[
  {
    "url": "https://www.iana.org/help/example-domains",
    "domain": "www.iana.org",
    "title": "Example Domains",
    "chunk_id": 0,
    "text": "Example Domains As described in RFC 2606 and RFC 6761 , a number of domains such as example.com and example.org are maintained for documentation purposes. These domains may be used as illustrative examples in documents without prior coordination with us. They are not available for registration or transfer. We provide a web service on the example domain hosts to provide basic information on the purpose of the domain. These web services are provided as best effort, but are not designed to support production applications. While incidental traffic for incorrectly configured applications is expected, please do not design applications that require the example domains to have operating HTTP service. Further Reading IANA-managed Reserved Domains Last revised 2017-05-13.",
    "length": 772
  },
  {
    "url": "https://pti.icann.org/",
    "domain": "pti.icann.org",
    "title": "Public Technical Identifiers (PTI)",
    "chunk_id": 0,
    "text": "Board Audit Committee Directors Meetings Governance Documents Articles of Incorporation Bylaws Bylaws Archive Board Code of Conduct Conflict of Interest Policy Expected Standards of Behavior Financial and Planning Information About PTI Agreements Public Technical Identifiers (PTI) is responsible for the operational aspects of coordinating the Internet s unique identifiers and maintaining the trust of the community to provide these services in an unbiased, responsible and effective manner.",
    "length": 493
  },
  {
    "url": "https://pti.icann.org/",
    "domain": "pti.icann.org",
    "title": "Public Technical Identifiers (PTI)",
    "chunk_id": 1,
    "text": "e trust of the community to provide these services in an unbiased, responsible and effective manner. Mainly, PTI is responsible for the operation of the IANA functions: Domain Names Number Resources Protocol Parameter Assignments Public Technical Identifiers (PTI) was incorporated in August 2016 as an affiliate of ICANN , and, through contracts and subcontracts with ICANN , began performing the IANA functions on behalf of ICANN in October 2016. Latest Updates search 10 Feb 2026 PTI FY26 Q2 Management Financials 09 Jan 2026 The ICANN Nominating Committee is soliciting candidates for the PTI Board of Directors.",
    "length": 616
  },
  {
    "url": "https://pti.icann.org/",
    "domain": "pti.icann.org",
    "title": "Public Technical Identifiers (PTI)",
    "chunk_id": 2,
    "text": "09 Jan 2026 The ICANN Nominating Committee is soliciting candidates for the PTI Board of Directors. 03 Dec 2025 PTI FY26 Q1 Management Financials 20 Oct 2025 PTI FY25 Audited Financial Statements 08 Sep 2025 PTI FY25 Q4 Management Financials 13 May 2025 PTI FY25 Q3 Management Financials 14 Apr 2025 PTI FY26 Operating Plan and Budget 14 Apr 2025 IANA 2030 Strategy: The PTI Strategic Plan covering 2025 to 2030 26 Mar 2025 PTI FY24 Internal Revenue Service (IRS) Tax Form 990 26 Mar 2025 PTI FY24 California Exempt Organization Annual Information Return (CA-199) 26 Mar 2025 PTI FY24 California Registration/Renewal Fee Report (RRF-1) 13 Feb 2025 PTI FY25 Q2 Management Financials 14 Jan 2025 The ICANN Nominating Committee is soliciting candidates for the PTI Board of Directors.",
    "length": 781
  },
  {
    "url": "https://pti.icann.org/",
    "domain": "pti.icann.org",
    "title": "Public Technical Identifiers (PTI)",
    "chunk_id": 3,
    "text": "14 Jan 2025 The ICANN Nominating Committee is soliciting candidates for the PTI Board of Directors. Resources search Date Document Name 30 Sep 2016 IANA Naming Function Contract [PDF 626 KB] 30 Sep 2016 Services Agreement [PDF 334 KB] 30 Sep 2016 IETF MoU Subcontract Agreement [PDF 338 KB] 30 Sep 2016 Numbering SLA Subcontract Agreement [PDF 335 KB] 30 Sep 2016 RZMA Subcontract Agreement [PDF 331 KB] 28 Sep 2016 Bylaws [PDF 506 KB] 28 Sep 2016 Board Code of Conduct [PDF 117 KB] 28 Sep 2016 Conflict of Interest Policy [PDF 147 KB] 28 Sep 2016 Expected Standards of Behavior [PDF 124 KB] 09 Aug 2016 Articles of Incorporation [PDF 115 KB] Related Links iana.org icann.org Customer Standing Committee (CSC).",
    "length": 710
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 0,
    "text": "In addition to the ICANN Languages , this content is also available in Portugu s Terms of Service Date Last Updated: 12 June 2020 Redline from the previous version of our Terms of Service The following Terms of Service apply to electronic platforms, applications, and online services (\"Platforms\") that are owned, operated, or sponsored by the Internet Corporation for Assigned Names and Numbers organization (\"ICANN organization\") and its affiliated organization Public Technical Identifiers (\"PTI\") where these terms are referenced, linked, or published.",
    "length": 556
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 1,
    "text": "ization Public Technical Identifiers (\"PTI\") where these terms are referenced, linked, or published. In these Terms of Service, ICANN and PTI are sometimes referred to collectively as \"we\", \"us\", or \"our.\" The singular term \"Platform\" includes all equivalent, mirror, replacement, substitute, or backup Platform, and all information and data made available or communicated via the Platform.",
    "length": 390
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 2,
    "text": "e, or backup Platform, and all information and data made available or communicated via the Platform. The Platform is made available subject to all of these terms and conditions and all of our operating rules, policies and procedures, including, without limitation, our Privacy Policy , the ICANN Expected Standards of Behavior , and ICANN Community Anti-Harassment Policy and Terms of Participation and Compliant Procedure , that may be published from time to time on the Platform by us (collectively, the \"Agreement\"). This Agreement is not intended to supersede or govern any other terms and conditions or any other operating rules, policies and procedures specific to any other program or service provided by us unless expressly stated by us in connection with such other program or service.",
    "length": 794
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 3,
    "text": "rvice provided by us unless expressly stated by us in connection with such other program or service. Also, you may be required to agree to additional terms and conditions applicable to specific functions and services offered in a Platform. Those additional terms and conditions supplement these Terms of Service, but apply only to your use of such functions and services. By accessing or using any part of the Platform, you agree to become bound by the terms and conditions of this Agreement. Data Privacy Policy In addition to these Terms of Service, we have established a Privacy Policy to explain how we collect and use information about you. We have also published a Cookies Policy that describes how, when and why we use tracking technologies on our Platforms.",
    "length": 765
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 4,
    "text": "hed a Cookies Policy that describes how, when and why we use tracking technologies on our Platforms. By accessing or using the Platform, you are also signifying your acknowledgement of our Privacy Policy and Cookies Policy. Your Account If you create an account on the Platform, you are responsible for maintaining the security of your account and you are fully responsible for all activities that occur under the account. You must immediately notify us of any unauthorized or suspicious uses of your account or any other breaches of security. We will not be liable for any acts or omissions by you, including any damages of any kind incurred as a result of such acts or omissions.",
    "length": 681
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 5,
    "text": "omissions by you, including any damages of any kind incurred as a result of such acts or omissions. By creating an account on the Platform, you may be required to provide information about yourself (such as identification or contact details) as part of the registration process for the Platform, or as part of your continued use of the Platform. Furthermore, you agree that the information that you share about yourself will be shared publicly for the purpose of displaying of profiles of ICANN community members and for identification of discussion contributors within the communication tools provided.",
    "length": 603
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 6,
    "text": "y members and for identification of discussion contributors within the communication tools provided. Responsibility of Contributors If you communicate, post material, or transfer information using the Platform, post links on the Platform, or otherwise make (or allow any third party to make) material available by means of the Platform (any such material, \"Content\"), you are entirely responsible for the Content of, and any harm resulting from, that Content.",
    "length": 459
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 7,
    "text": "ntent\"), you are entirely responsible for the Content of, and any harm resulting from, that Content. By making Content available, you represent and warrant that: communicating, downloading, copying and using the Content will not infringe the proprietary rights, including but not limited to the copyright, patent, trademark or trade secret rights, of any person or third party organization; if your employer has rights to intellectual property you create, you have either (i) received permission from your employer to post or make available the Content, including but not limited to any software, or (ii) secured from your employer a waiver as to all rights in or to the Content; you have fully complied with any third-party licenses relating to the Content, and have done all things necessary to successfully pass through to end users any required terms; the Content does not contain or install any viruses, worms, malware, Trojan horses or other harmful or destructive material or information; the Content complies with any applicable third party terms and conditions you have accepted applicable to the Content or the use of the third party services needed for your use of the Platform; the Content is not spam, is not machine-generated or randomly-generated, and does not contain unethical or unwanted commercial content material designed to drive traffic to third party sites or boost the search engine rankings of third party sites, or to further unlawful acts (such as phishing) or mislead recipients as to the source of the material (such as spoofing); the Content is not pornographic, does not contain threats or incite violence, and does not violate the privacy or publicity rights of any third party; the Content does not consist of unsolicited promotional materials such as spam links on newsgroups, email lists, blogs and web sites, and other similar unsolicited promotional methods; the Content is not named in a manner that misleads others into thinking that you are another person or company; you have, in the case of Content that includes computer code, accurately categorized and/or described the type, nature, uses and effects of the materials, whether requested to do so by us or otherwise; and the Content complies with the ICANN Expected Standards of Behavior and ICANN Community Anti-Harassment Policy and Terms of Participation and Compliant Procedure.",
    "length": 2376
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 8,
    "text": "avior and ICANN Community Anti-Harassment Policy and Terms of Participation and Compliant Procedure. Content Contributions and Cancelations We have the right (though not the obligation) to, in our sole discretion, (i) refuse or remove any Content that, in our reasonable opinion, violates any of our policy or procedure or is in any way harmful or objectionable, or (ii) cancel any registration or account to use a Platform, or (iii) terminate or deny access to and use of the Platform to any individual or entity, in each case for any reason and in our sole discretion. Responsibility of Platform Visitors We have not reviewed, and cannot review, all of the material posted to the Platform, and cannot therefore be responsible for that material's Content, use or effects.",
    "length": 772
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 9,
    "text": "ed to the Platform, and cannot therefore be responsible for that material's Content, use or effects. By operating the Platform, we do not represent or imply that it endorses the material there posted, or that it believes such material to be accurate, useful or non-harmful. You are responsible for taking precautions as necessary to protect yourself and your computer systems from viruses, worms, Trojan horses, and other harmful or destructive Content. You are solely responsible for your use of the Platform and agree to abide by, and comply with, all laws in connection with your use of the Platform, including but not limited to laws related to recording, intellectual property, privacy and export control.",
    "length": 710
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 10,
    "text": "ing but not limited to laws related to recording, intellectual property, privacy and export control. Age Restrictions In order to use the Platform on your own behalf, you must be at least 18 years of age. If you are between the ages of 16 and 18, you may still use the Platform, but you must have a parent or legal guardian provide valid and verifiable consent to your use of the Platform and acceptance of these Terms of Service. Content Posted on Other Platforms The Platform may contain add-on services, hyperlinks or references to third party services and websites that are not our vendors. These third party websites and services are outside of our control and are operated by third parties.",
    "length": 696
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 11,
    "text": "hese third party websites and services are outside of our control and are operated by third parties. We have not reviewed, and cannot review, all of the material made available through third party online services, websites and webpages to which the Platform links, and that link to the Platform that we are not responsible for, nor shall it be liable to you for your access and use of any such third party hyperlinks, websites or services. The appearance on the Platform of external online services and hyperlinks, in any form, does not constitute endorsement by us of the opinions or views expressed by any such third-party websites and we do not take responsibility for the accuracy, currency, completeness, or quality of the Content contained at such websites and third-party services.",
    "length": 788
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 12,
    "text": "rrency, completeness, or quality of the Content contained at such websites and third-party services. Furthermore, we are not responsible for the quality or delivery of the products or services offered, provided, accessed, or advertised by any third party. As such, we will not be responsible or liable to you in any way for any Content, errors, or omissions, or for the results obtained from the use of any information contained in or provided to those third-party sites. You are responsible for taking precautions as necessary to protect yourself and your computer systems from viruses, worms, Trojan horses, and other harmful or destructive Content. We disclaim any responsibility for any harm resulting from your use of third-party websites and webpages.",
    "length": 757
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 13,
    "text": "sclaim any responsibility for any harm resulting from your use of third-party websites and webpages. Copyright Infringement and Digital Millennium Copyright Act (DMCA) Policy As we ask others to respect our intellectual property rights, we respect the intellectual property rights of others. We will terminate a visitor's access to and use of the Platform if, under appropriate circumstances, the visitor is determined to be a repeat infringer of our or other party's copyrights or other intellectual property rights.",
    "length": 517
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 14,
    "text": "d to be a repeat infringer of our or other party's copyrights or other intellectual property rights. If you believe that your intellectual property is being used on the Platform in a way that constitutes copyright infringement, please provide our Designated Agent (set forth below) the following information (as required by Section 512(c)(3) of the Digital Millennium Copyright Act): A physical or electronic signature of a person authorized to act on behalf of the owner of an exclusive right that is allegedly infringed; Identification of the copyrighted work claimed to have been infringed, or, if multiple copyrighted works at a single online site are covered by a single notification, a representative list of such works at that site; Identification of the material that is claimed to be infringing or to be the subject of infringing activity and that is to be removed or access to which is to be disabled, and information reasonably sufficient to permit the service provider to locate the material; Information reasonably sufficient to permit the service provider to contact the complaining party, such as an address, telephone number, and, if available, an email address at which the complaining party may be contacted; A statement that the complaining party has a good faith belief that use of the material in the manner complained of is not authorized by the copyright owner, its agent, or the law; and A statement that the information in the notification is accurate and, under penalty of perjury, that the complaining party is authorized to act on behalf of the owner of an exclusive right that is allegedly infringed.",
    "length": 1629
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 15,
    "text": "party is authorized to act on behalf of the owner of an exclusive right that is allegedly infringed. The information specified above must be sent to our Designated Agent, whose contact information is as follows: ICANN Attn: ICANN Legal 12025 Waterfront Drive, Suite 300 Los Angeles, CA 90094 Tel: 310-301-5800 Email: legal-intellectual-property@icann.org Please note that Section 512(f) of the Digital Millennium Copyright Act may impose liability for damages on any person who knowingly sends meritless notices of infringement. Any information or correspondence that you provide to us may be shared with third parties, including the person who provided us with the allegedly infringing material.",
    "length": 696
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 16,
    "text": "red with third parties, including the person who provided us with the allegedly infringing material. Upon receipt of a bona fide infringement notification by the Designated Agent, it is our policy to remove or disable access to the infringing material, notify the user who posted the material that we have removed or disabled access to the material, and, for repeat offenders, to terminate such user's access to the service.",
    "length": 424
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 17,
    "text": "d access to the material, and, for repeat offenders, to terminate such user's access to the service. If you believe that your Content should not have been removed for alleged copyright infringement, you may send our Designated Agent a written counter-notice with the following information: Identification of the copyrighted work that was removed, and the location on the Platform where it would have been found prior to its removal; A statement, under penalty of perjury, that you have a good faith belief that the Content was removed as a result of a mistake or misidentification; and Your physical or electronic signature, together with your contact information (address, telephone number and, if available, email address).",
    "length": 725
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 18,
    "text": "together with your contact information (address, telephone number and, if available, email address). If a counter-notice is received by the Designated Agent, we may send a copy of the counter-notice to the original complaining party, informing that person that we may replace the removed material or cease disabling it in 10 business days. Unless the copyright owner files an action seeking a court order against the user, the removed material may be replaced or access to it restored in 10 to 14 business days or more after receipt of the counter-notice, at our discretion. We will terminate a visitor's access to and use of the Platform if, under appropriate circumstances, the visitor is determined to be a repeat infringer of our or other party's copyrights or other intellectual property rights.",
    "length": 800
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 19,
    "text": "d to be a repeat infringer of our or other party's copyrights or other intellectual property rights. Intellectual Property This Agreement does not transfer from us to you any of our or third party intellectual property, and all right, title and interest in and to such property will remain (as between the parties) solely with us. All trademarks, service marks, graphics and logos used in connection with the Platform are trademarks or registered trademarks of our organization or other third parties. Your use of the Platform grants you no right or license to reproduce or otherwise use any intellectual property belonging to our organization or other third parties.",
    "length": 667
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 20,
    "text": "uce or otherwise use any intellectual property belonging to our organization or other third parties. Disclaimer and Limitation of Liability TO THE FULLEST EXTENT PERMISSIBLE PURSUANT TO APPLICABLE LAW, ICANN ORGANIZATION, ITS SUBSIDIARIES AND AFFILIATES, AND EACH OF THEIR RESPECTIVE OFFICERS, DIRECTORS, MEMBERS, SHAREHOLDERS, EMPLOYEES, ASSOCIATES, AGENTS, LICENSORS, REPRESENTATIVES, AND THIRD-PARTY PROVIDERS WILL NOT BE LIABLE TO YOU FOR ANY COMPENSATORY, CONSEQUENTIAL, INCIDENTAL, EXEMPLARY, DIRECT, INDIRECT, SPECIAL, PUNITIVE, OR SIMILAR DAMAGES, THAT MAY RESULT FROM THE USE OF, ACCESS TO, OR THE INABILITY TO USE, THE PLATFORM OR ANY MATERIALS CONTAINED IN THE PLATFORM, WHETHER THE MATERIAL IS PROVIDED OR OTHERWISE SUPPLIED BY US OR ANY THIRD PARTY.",
    "length": 762
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 21,
    "text": "ED IN THE PLATFORM, WHETHER THE MATERIAL IS PROVIDED OR OTHERWISE SUPPLIED BY US OR ANY THIRD PARTY. If, notwithstanding the other provisions of these Terms and Conditions, we are found to be liable to you for any damages or losses arising out of your use of, access to or inability to use the Platform or any material provided or otherwise supplied by us or any third party, our liability shall in no event exceed US $25.00. Note that some jurisdictions do not allow limitations of liability or may place limitations on our ability to limit its liability to you, so the foregoing limitation may not apply to you.",
    "length": 613
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 22,
    "text": "ions on our ability to limit its liability to you, so the foregoing limitation may not apply to you. We do not warrant that the functional aspects of the Platform will be uninterrupted or error-free or that the Platform or the servers that make it available are free of viruses or other harmful components. Without limiting the foregoing, everything in the Platform is provided to you \"as is\" without warranty of any kind, either expressed or implied, including, but not limited to, the implied warranties of merchantability, fitness for a particular purpose, or non-infringement.",
    "length": 580
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 23,
    "text": "o, the implied warranties of merchantability, fitness for a particular purpose, or non-infringement. Governing Law This Agreement, and any disputes or claims arising out of or relating to this Agreement, is subject to the laws of the state of California, without giving effect to any conflict of laws principles that may provide the application of the law of another jurisdiction. AS DESCRIBED BELOW, IT LIMITS: (i) YOUR ABILITY TO LITIGATE CERTAIN CLAIMS IN COURT; (ii) YOUR RIGHT TO HAVE A JURY DECIDE CERTAIN CLAIMS; AND (iii) YOUR ABILITY TO COMBINE CLAIMS AND TO BRING CLAIMS THROUGH CLASS ACTIONS. YOU UNDERSTAND THAT BY USING AND/OR BECOMING A REGISTERED USER OF THE PLATFORM OR SERVICES, YOU CONSENT AND CHOOSE TO HAVE SUCH CLAIMS SUBMITTED TO BINDING ARBITRATION.",
    "length": 772
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 24,
    "text": "E PLATFORM OR SERVICES, YOU CONSENT AND CHOOSE TO HAVE SUCH CLAIMS SUBMITTED TO BINDING ARBITRATION. YOU UNDERSTAND THAT NO ARBITRATION OR PROCEEDING WILL BE COMBINED WITH ANOTHER WITHOUT THE PRIOR WRITTEN CONSENT OF ALL PARTIES TO ALL AFFECTED ARBITRATIONS OR PROCEEDINGS.",
    "length": 273
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 25,
    "text": "NOTHER WITHOUT THE PRIOR WRITTEN CONSENT OF ALL PARTIES TO ALL AFFECTED ARBITRATIONS OR PROCEEDINGS. To the fullest extent permissible pursuant to applicable law, you agree that, except as otherwise set forth in this Section, all Claims (defined as any dispute or controversy arising out of or relating to this Agreement, your use of or inability to use the Platform, Content or services, except the following types of disputes and controversies: (a) any claim seeking to enforce or protect, or concerning the validity of, any of our intellectual property rights; (b) any claim related to, or arising from, allegations of theft, piracy, or unauthorized use; (c) any claim for injunctive relief; and (d) any claim within the jurisdictional limits of the small claims courts) between you and us (and its officers, directors, executives, agents, and employees) shall be resolved through binding arbitration administered by JAMS, pursuant to its Comprehensive Arbitration Rules and Procedures and in accordance with the Expedited Procedures in those rules in effect at the time the Claim is filed.",
    "length": 1093
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 26,
    "text": "in accordance with the Expedited Procedures in those rules in effect at the time the Claim is filed. Each Claim shall be submitted to a single arbitrator selected through mutual agreement of the parties. Judgment upon the award may be entered and enforced in any court having jurisdiction or application may be made for judicial acceptance of the award and an order of enforcement. Except as otherwise indicated in this Agreement, the arbitrator, and not any federal, state, or local court, shall have exclusive authority to resolve any dispute relating to the interpretation, applicability, and/or enforceability of this Agreement and any terms or documents incorporated herein, including any claim that all or any part of this Agreement, are void or voidable.",
    "length": 761
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 27,
    "text": "corporated herein, including any claim that all or any part of this Agreement, are void or voidable. The arbitration proceedings shall be held in Los Angeles County, California and shall be subject to this Agreement and the laws of the State of California, United States, without regard to conflicts of law provisions thereof. The arbitrator shall not have authority to combine or aggregate similar claims or conduct any Class Action (as defined below), or make an award to any person or entity not a party to the arbitration. No arbitration or proceeding will be combined with another without the prior written consent of all parties to all affected arbitrations or proceedings.",
    "length": 679
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 28,
    "text": "nother without the prior written consent of all parties to all affected arbitrations or proceedings. Before you take a dispute to arbitration or to small claims court, you must first contact us in writing and describe: (a) the nature and basis of the Claim or dispute; and (b) the specific relief sought to give us an opportunity to resolve the dispute. Similarly, before we take a dispute to arbitration, we must first attempt to resolve it by contacting you. If we do not reach an agreement to resolve the claim within sixty (60) days from the date such notification is provided, you or we may commence an arbitration proceeding.",
    "length": 631
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 29,
    "text": "days from the date such notification is provided, you or we may commence an arbitration proceeding. If we prevail before the arbitrator, and if we show that you acted in bad faith in bringing your claim, then we may seek to recover the JAMS' fees and expenses of the arbitrator from you. Class Action Waiver Each of us expressly agree that any Claim(s) must be brought in the respective party's individual capacity, and not as a plaintiff or class member in any purported class, collective, representative, multiple plaintiff, or similar proceeding (\"Class Action\"). Each of us expressly agree to waive any ability to maintain any Class Action in any forum raising a Claim covered by this Section.",
    "length": 697
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 30,
    "text": "waive any ability to maintain any Class Action in any forum raising a Claim covered by this Section. Notwithstanding any other provision of this Agreement to the contrary, any Claim, dispute, or controversy alleging that all or part of the Class Action waiver contained in this Section is invalid, illegal, unenforceable, void, or voidable may be determined only by a court of competent jurisdiction and not by an arbitrator. Changes We reserve the right, at its sole discretion, to modify or replace any part of this Agreement. Your continued use of or access to the Platform following the notification of any changes to this Agreement constitutes acceptance of those changes.",
    "length": 677
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 31,
    "text": "following the notification of any changes to this Agreement constitutes acceptance of those changes. We may also, in the future, offer new services and/or features through the Platform (including, the release of new tools and resources). Termination We may terminate your access to all or any part of the Platform at any time, with or without cause, with or without notice, effective immediately. All provisions of this Agreement which by their nature should survive termination shall survive termination, including, without limitation, ownership provisions, warranty disclaimers, indemnity and limitations of liability.",
    "length": 620
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 32,
    "text": "hout limitation, ownership provisions, warranty disclaimers, indemnity and limitations of liability. General Representation and Warranty You represent and warrant that (i) your use of the Platform will be in strict accordance with this Agreement and with all applicable laws and regulations (including without limitation any local laws or regulations in your country, state, city, or other governmental area, regarding online conduct and acceptable Content, and including all applicable laws regarding the transmission of technical data exported from the country in which this Platform resides or the country in which you reside); and (ii) your use of the Platform will not infringe or misappropriate the intellectual property rights of any third party.",
    "length": 753
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 33,
    "text": "he Platform will not infringe or misappropriate the intellectual property rights of any third party. Our failure to enforce, or delay in enforcing, any provision of these Terms of Service will not constitute a waiver of such right. If a part of this Agreement cannot be enforced as written, then that part will be replaced with terms that most closely match the intent of the Parties to the extent permitted by applicable law. The invalidity of part of these Terms of Service will not affect the validity and enforceability of the remaining provisions. Nothing in the Terms of Service creates any partnership, joint venture, franchise, employment, or other agency relationship between us and you.",
    "length": 696
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 34,
    "text": "partnership, joint venture, franchise, employment, or other agency relationship between us and you. You may not assign any of your rights under these Terms of Service, and any such attempt will be null and void. We may, in our sole discretion, transfer, delegate, subcontract or assign, without notifying you, any rights or obligations under these Terms of Service. The Parties do not intend for these Terms of Service to confer any right or benefit on any third party. No third party may commence or prosecute an action against a Party to these Terms of Service claiming to be a third-party beneficiary of these Terms of Service or any of the transactions contemplated in these Terms of Service.",
    "length": 696
  },
  {
    "url": "https://www.icann.org/en/data-protection/terms-of-service",
    "domain": "www.icann.org",
    "title": "Terms of Service",
    "chunk_id": 35,
    "text": "ficiary of these Terms of Service or any of the transactions contemplated in these Terms of Service. Effective Date of Terms of Service These Terms of Service are effective and were last updated on 12 June 2020..",
    "length": 212
  },
  {
    "url": "https://www.iana.org/archive",
    "domain": "www.iana.org",
    "title": "Archive",
    "chunk_id": 0,
    "text": "Archive These are archived documents from prior services, projects or oversight mechanism that are no longer active. These documents should not be relied upon for up-to-date information on operations and are provided for historical purposes only. Internet Monthly Reports (1991-1998) ccTLD News (1997-2003) NTIA Contract (2000-2016) Initial Root DNSSEC Design and Launch (2008-2010) First KSK Rollover Project (2015-2018)",
    "length": 421
  },
  {
    "url": "https://www.iana.org/contact",
    "domain": "www.iana.org",
    "title": "Contact Us",
    "chunk_id": 0,
    "text": "Contact Us If you have questions regarding abuse, please see our Abuse Issues and IP Addresses Page . General email contact iana@iana.org Postal address Internet Assigned Numbers Authority 12025 Waterfront Drive, Suite 300 Los Angeles CA 90094 USA Telephone contacts +1-424-254-5300 (phone) +1-424-254-5033 (facsimile)",
    "length": 318
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 0,
    "text": "In addition to the ICANN Languages , this content is also available in Portugu s Privacy Policy Date Last Updated: 5 March 2021 [ Redline from the previous version of our Privacy Policy ] [PDF, 201 KB] The Internet Corporation for Assigned Names and Numbers (ICANN organization) respects the protection and privacy of Personal Information. This policy (Privacy Policy) and the Cookies Policy set out how ICANN organization, which for the purposes of this policy includes its affiliated organization Public Technical Identifiers (PTI) (collectively \"we\", \"us\", or \"our\"), and their managed or sponsored programs, will use and handle electronic information provided by or collected from individuals and what choices individuals have regarding the collection and use of the information.",
    "length": 783
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 1,
    "text": "m individuals and what choices individuals have regarding the collection and use of the information. This Privacy Policy applies to all electronic collection and use of Personal Information, including via any mobile version of the websites, mobile applications, electronic mail, and other electronic services that link to this Privacy Policy (collectively, the Platforms). The term \"User\" or \"you\" refers to (i) individuals that provide their own Personal Information or Personal Information of others on behalf of such other persons to us and (ii) any organization where a person provides Personal Information of others on behalf of such organization. By using the Platforms, you (including any entity or person on whose behalf you are acting) agree to the terms of this Privacy Policy, as updated.",
    "length": 799
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 2,
    "text": "ity or person on whose behalf you are acting) agree to the terms of this Privacy Policy, as updated. If you do not agree with the practices described in this Privacy Policy, please do not provide us with Personal Information or interact with the Platforms. This Privacy Policy supplements, and does not supersede, any other privacy policy or statement from us relating to any of our unique programs. If you have any questions about this Privacy Policy or our Processing of your Personal Information as the Data Controller, please feel free to contact us at privacy@icann.org.",
    "length": 575
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 3,
    "text": "ur Personal Information as the Data Controller, please feel free to contact us at privacy@icann.org. This Privacy Policy covers the following key topics: Definitions Personal Information Collection Use of Personal Information Retention Sharing of Personal Information International Transfers Information Security and Integrity Do Not Track Exercise of Data Subject Rights Minors Revisions to our Privacy Policy Questions Definitions \"Cookies\" are small text files placed on your computer while visiting certain sites on the Internet used to identify your computer. Please visit our Cookies Policy to learn more about Cookies and certain functions and features on our Platforms.",
    "length": 677
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 4,
    "text": "our Cookies Policy to learn more about Cookies and certain functions and features on our Platforms. \"Data Controller\" means the natural or legal person, public authority, agency or other body which, alone or jointly with others, determines the purposes and means of the Processing of Personal Information. \"Data Processor\" means a natural or legal person, public authority, agency or any other body which Processes Personal Information on behalf of the Data Controller. \"Non-Identifying Information\" means information that may relate to an individual but does not by itself identify that individual. For example, Web Information is Non-Identifying Information, as is information such as gender, age, city, and physical location, when not linked with other Personal Information.",
    "length": 777
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 5,
    "text": "n such as gender, age, city, and physical location, when not linked with other Personal Information. \"Personal Information\" means any information relating to an identified or identifiable natural person, as defined under applicable law, such as name, home address, telephone number, picture, video recording, or email address.",
    "length": 326
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 6,
    "text": "cable law, such as name, home address, telephone number, picture, video recording, or email address. Personal Information Collection This Privacy Policy applies to the following types of electronic information about Users or use of the Platforms: Personal Information submitted to us: This may be personal contact, identification, and location information, such as name, home or work address, personal or business email address, contact details such as your home, facsimile or mobile phone number, gender, age or date of birth, job title, country of residence, school, affiliation or organization, username, domain name (if personally identifiable), User's photo or image, government issued identification numbers or passport details, or emergency contact details that Users may submit in connection with any of our services or programs, including, for example, public comment submissions, program or service applications, community surveys, email list subscription, general enquiries, event registration, or online meetings.",
    "length": 1025
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 7,
    "text": "mmunity surveys, email list subscription, general enquiries, event registration, or online meetings. This also includes information provided to us on the Platforms that would constitute personal data under applicable law. Personal Information received from a third party: This may include Personal Information such as name and address for identity verification or to Process a request or an application submitted to us. Financial information: This may include financial account information or financial transaction information when participating in any of our services or programs where such information is requested or generated.",
    "length": 630
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 8,
    "text": "n participating in any of our services or programs where such information is requested or generated. Automatically logged use information: The Platforms may automatically record information that is sent by the User's browser or device when accessing and using the Platforms, which can be identifying or non-identifying. This information may include information such as IP address, browser type, internet service provider (ISP), date/time stamp, page viewed, operating system, mobile device information, clickstream information, preference information, and other similar information. Cookies and other tracking technologies: Cookies and other user tracking technologies devices may be stored on the User's computer when using the Platforms.",
    "length": 739
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 9,
    "text": "er user tracking technologies devices may be stored on the User's computer when using the Platforms. You acknowledge the use of such tracking devices as noted in this Privacy Policy and the Cookies Policy , and consent to having such tracking devices stored on your computing devices. Recordings, Photographs, and Transcripts: We collect and maintain recordings, photographs, and/or transcripts of public and closed meetings, including through virtual meeting Platforms, which contain your Personal Information if you are a participant. Such recordings, photographs, and transcripts of these meetings are processed based on our legitimate interest of promoting accountability, openness, and transparency.",
    "length": 704
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 10,
    "text": "processed based on our legitimate interest of promoting accountability, openness, and transparency. Such recordings, photographs, and transcripts of these meetings, and any Personal Information contained in them, may be publicly accessible. When meetings and sessions are hosted by us and recorded, we will notify you and other participants of the recording before the start of each meeting. When we record a meeting, your Personal Information contained in any recording and related transcript will be processed in accordance with this Privacy Policy. This Policy does not apply to any meetings using a service that is not provided or supported by us, unless otherwise stated with respect to that service.",
    "length": 705
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 11,
    "text": "rvice that is not provided or supported by us, unless otherwise stated with respect to that service. Please note that individuals that elect to provide, host, or participate in a meeting not using a service not provided or supported by us are solely responsible for ensuring that participants give their informed consent to the recording, and that all legal requirements applicable to the collection, recording, and processing of Personal Information are fully satisfied.",
    "length": 471
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 12,
    "text": "applicable to the collection, recording, and processing of Personal Information are fully satisfied. Use of Personal Information We will Process Personal Information only for fair, lawful, and legitimate reasons, including to: To improve our Platforms' performance, content, and services; To perform information analysis, compliance audits, data metrics, develop new services, and protect the Platforms and integrity of any of our services or programs; To create anonymized data sets to improve the Platforms' performance or in connection with our services or programs; To respond to User questions, comments, inquiries, feedback, including those concerning our services or programs or with respect to services provided by registry operators, accredited registrars, and data escrow agents; To assist in policy discussion, development activities, and performance of activities consistent with our functions; To administer participation or registration in any of our services, activities, programs, meetings, and Platforms, including sending electronic communications related to such participation or registration, and to manage and report on these participations, interactions and relationships; To assist with travel support for participants related to our events; To maintain archival records of a User's participation for historical and research purposes, subject to retention limits imposed by applicable laws; To process payments and fulfill a transaction between a User and us, if the User submits payment information in connection with any of our services or programs; To reimburse expenses related to any of our meetings or other events or programs; To perform relevant contractual obligations with the User and other third parties; To administer User's application for any of our services or programs; To publish a User's Personal Information such as his or her name and organization or affiliate on the Platforms; To publish a User's comments or feedback along with a User's name for the benefit of others and otherwise to comply with our accountability and transparency principles; To register and provide access to our meetings, which could involve processing of a User's dietary restrictions or disability information for special accommodations; To expedite and obtain approval for a User's visa application to attend our meetings; To share basic participant information (name, organization, affiliation) or other information the User voluntarily chooses to provide with other participants of the same meeting; To provide updates, news and other information regarding our programs, events and service delivery; and To provide information or a service requested by the User.",
    "length": 2685
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 13,
    "text": "rograms, events and service delivery; and To provide information or a service requested by the User. We will also process your Personal Information with your consent, where required by applicable law, to send you newsletters, and provide you with marketing information concerning news, updates, and other information regarding our programs, events. Lastly, we will Process Personal Information to comply with applicable laws, rules, regulations, court orders, and law enforcement requests. We will not use Personal Information for any other purpose other than as set forth in this Privacy Policy.",
    "length": 596
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 14,
    "text": "l not use Personal Information for any other purpose other than as set forth in this Privacy Policy. We will use Non-Identifying Information generally for the same purposes as with Personal Information, and to improve User services, store User's Platform preferences, track Platform use trends, improve the Platforms' performance, help maintain personal and device identity verification, Platform security, and measure effectiveness of electronic communications. Retention We will retain certain Personal Information stored on our servers in accordance with our general archival practices and as required or permitted by law. We will store the User's Personal Information only for as long as is required to fulfill the purposes set out above.",
    "length": 742
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 15,
    "text": "e User's Personal Information only for as long as is required to fulfill the purposes set out above. However, where we are required by law to retain a User's Personal Information longer or where a User's Personal Information is required for us to assert or defend against legal claims, we will retain the User's Personal Information until the end of the relevant retention period or until the claims in question have been resolved. Sharing of Personal Information We may share certain Personal Information with contractors and other agents for the purpose of Processing this information on our behalf and providing other services to us or to the User on our behalf.",
    "length": 665
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 16,
    "text": "sing this information on our behalf and providing other services to us or to the User on our behalf. These third parties include providers that provide services such as data analysis, email transmission, customer relationship management (CRM), IT security, cloud service providers, database management, hotel and other travel service, asset management solutions, consultants, and financial or legal advisors. We require that these parties agree to handle this information in compliance with appropriate confidentiality obligations and security measures. We also may publish some Personal Information on the Platforms in a manner that is viewable by our community members, as described in the relevant program description.",
    "length": 721
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 17,
    "text": "manner that is viewable by our community members, as described in the relevant program description. We will provide Personal Information to such third parties, government authorities and agencies to: comply with applicable laws, regulations, legal process or enforceable governmental request; if permitted or required by law or in response to a law enforcement or other legal request; protect our or a third party's legal rights, including the enforcement of terms with Users; receive contracted services or use of licensed products from third party providers; comply with any court order or legal proceeding; comply with our accountability and transparency principles and disclosure policies; identify the User to anyone that the User sends a communication through the Platforms; effectuate a reorganization or organizational change resulting in the divestiture or transfer of any of our operation, unit, function, or asset to such third party; detect, prevent or otherwise address fraud or other criminal activity or errors, security or technical issues; or protect against imminent harm to our rights, property, or the safety of our users or the public as required or permitted by law.",
    "length": 1188
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 18,
    "text": "m to our rights, property, or the safety of our users or the public as required or permitted by law. We will not sell or otherwise share any Personal Information with third parties for marketing purposes. International Transfers By using our Platforms or providing us with your Personal Information electronically, the User is directly transferring Personal Information and Non-Identifiable Information to us in the United States. The User's Personal Information also may be transferred and Processed in other countries where our staff or third-party service providers are located. The United States and such other countries may not have the same level of information protection as the User's jurisdiction.",
    "length": 706
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 19,
    "text": "ch other countries may not have the same level of information protection as the User's jurisdiction. Whenever such transfers are by one of our location in a country outside the United States to another of our location in the United States, they are based on contractual commitments, such as the Standard Contractual Clauses (according to EU Commission Decision 87/2010/EC or any future replacement), or other applicable data transfer arrangements, in order to contractually provide that your Personal Information is subject to adequate levels of data protection. You may request further information concerning such contractual commitments by sending a request to privacy@icann.org.",
    "length": 681
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 20,
    "text": "rther information concerning such contractual commitments by sending a request to privacy@icann.org. The User is solely responsible for compliance with any information protection or privacy obligations in the User's jurisdiction when using the Platforms or providing us with Personal Information. Information Security and Integrity We will use reasonable industry standard safeguards (which may include physical, procedural and technical measures) to protect against the unauthorized disclosure of Personal Information it collects and holds. We will take reasonable steps to ensure that Personal Information collected is complete and relevant to its intended use. The Platforms contain links to other third-party websites, which are subject to the respective privacy policies of those third parties.",
    "length": 799
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 21,
    "text": "r third-party websites, which are subject to the respective privacy policies of those third parties. We are not responsible for the privacy practices of such linked third-party sites, and their owners and operators. The Platforms may contain social media widgets including Twitter, Facebook and LinkedIn, and other features that may collect a User's Personal Information and Non-Identifying Information and may set Cookies on the User's devices unless the device or browser settings prevent such Cookies from being stored. We are not responsible for the operation of such widgets and features, and any information collection will be subject to the privacy policy of the provider of such widgets and features, and not this Privacy Policy.",
    "length": 737
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 22,
    "text": "ect to the privacy policy of the provider of such widgets and features, and not this Privacy Policy. Due to the open communication nature of the Internet, we cannot represent, warrant or guarantee that communications stored on our servers will be free from unauthorized access by third parties, loss, misuse, or alterations. While we will take reasonable and appropriate security measures to protect against unauthorized access, disclosure, alteration or destruction of Personal Information received, WE DISCLAIM ANY AND ALL LIABILITY FOR UNAUTHORIZED ACCESS OR USE OR COMPROMISE OF YOUR PERSONAL INFORMATION TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW.",
    "length": 659
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 23,
    "text": "OR USE OR COMPROMISE OF YOUR PERSONAL INFORMATION TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW. Exercise of Data Subject Rights Users may be entitled to obtain access to information on the Processing of Personal Information, to object to certain Processing, request information portability, and have their Personal Information rectified, deleted, or otherwise restricted in terms of Processing, in each case as permitted under applicable law. Users also may be entitled to withdraw any consent given with prospective effect with respect to the Processing of their Personal Information. Users can exercise these rights or learn more about the Processing of Personal Information by us, by sending a request to privacy@icann.org.",
    "length": 731
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 24,
    "text": "more about the Processing of Personal Information by us, by sending a request to privacy@icann.org. All privacy-related access requests are taken seriously, and we will respond to request(s) as soon as reasonably practicable, but in any case, within the legally required period of time. Please note that certain Personal Information may be exempt from such access, correction, objection, or deletion rights pursuant to local laws. If you are not satisfied with our response or believe that your Personal Data is not being Processed in accordance with the law, you also may contact or lodge a complaint with the competent supervisory authority or seek other remedies under applicable law.",
    "length": 687
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 25,
    "text": "ge a complaint with the competent supervisory authority or seek other remedies under applicable law. If a User no longer wishes to receive certain electronic communications from us, the User may opt-out from such communication by following the unsubscribe instructions at the bottom of such communication or by accessing any available preference setting functionality in the Platforms. Minors We do not knowingly collect or require Personal Information from children under the age of 13. If you believe your child has provided us with Personal Information, please notify us by email at privacy@icann.org. You are responsible for ensuring we have a deliverable email address for you, and for periodically monitoring and reviewing any updates to this Privacy Policy.",
    "length": 764
  },
  {
    "url": "https://www.icann.org/en/data-protection/privacy-policy",
    "domain": "www.icann.org",
    "title": "Privacy Policy",
    "chunk_id": 26,
    "text": "l address for you, and for periodically monitoring and reviewing any updates to this Privacy Policy. Your continued use of our Platforms after such amendments will be deemed your acknowledgement of these changes to this Privacy Policy. Questions Should you have any questions or concerns about this Privacy Policy and our privacy practices, you may contact us at privacy@icann.org ..",
    "length": 383
  },
  {
    "url": "https://www.iana.org/about/excellence",
    "domain": "www.iana.org",
    "title": "Business Excellence and Quality Management",
    "chunk_id": 0,
    "text": "Business Excellence and Quality Management We are committed to operations excellence and have had an ongoing Business Excellence activity for the IANA functions since 2009. We are pleased to have received EFQM Committed to Excellence recognition for these departments following an assessment conducted by a panel of three independent assessors in August 2013. Founded in 1989, EFQM (the European Foundation for Quality Management) is the not-for-profit membership foundation that publishes the EFQM Excellence Model, a comprehensive management framework used by over 30,000 organizations around the world. The model helps organizations achieve and sustain outstanding levels of performance that meet or exceed the expectations of all their stakeholders.",
    "length": 753
  },
  {
    "url": "https://www.iana.org/about/excellence",
    "domain": "www.iana.org",
    "title": "Business Excellence and Quality Management",
    "chunk_id": 1,
    "text": "in outstanding levels of performance that meet or exceed the expectations of all their stakeholders. It allows people to understand the cause and effect relationships between what their organization does and the results it achieves. The model is based on the Fundamental Concepts of Excellence: Adding value for customers Creating a sustainable future Developing organizational capability Harnessing creativity and innovation Leading with vision, inspiration and integrity Managing with agility Succeeding through the talent of people Sustaining outstanding results The Fundamental Concepts of Excellence form the basis for the criteria of the EFQM Excellence Model.",
    "length": 666
  },
  {
    "url": "https://www.iana.org/about/excellence",
    "domain": "www.iana.org",
    "title": "Business Excellence and Quality Management",
    "chunk_id": 2,
    "text": "The Fundamental Concepts of Excellence form the basis for the criteria of the EFQM Excellence Model. We remain committed to using the EFQM model to perform continual review and improvement of the IANA services we provide to the community..",
    "length": 239
  },
  {
    "url": "https://www.iana.org/performance",
    "domain": "www.iana.org",
    "title": "Performance",
    "chunk_id": 0,
    "text": "Performance At a glance Naming 97.9% SLAs met between October and December 2025 Protocol Parameters 100% SLAs met between October and December 2025 Numbers 100% SLAs met between October and December 2025 Satisfaction 100% customer satisfaction during December 2025 System Status No known issues. Performance Reports Engagement Surveys A third-party survey is conducted annually to assess sentiment and areas of focus from our key stakeholders. Naming Performance Monthly reporting against the service level agreements for the IANA Naming Functions, including root zone management. Number Resource Performance Monthly reporting on performance against requirements under the Number Resource SLAs.",
    "length": 694
  },
  {
    "url": "https://www.iana.org/performance",
    "domain": "www.iana.org",
    "title": "Performance",
    "chunk_id": 1,
    "text": "ce Performance Monthly reporting on performance against requirements under the Number Resource SLAs. IETF Statistics Report Monthly documentation of the performance of the protocol assignments roles performed for the IETF community. Naming Performance Dashboard Real-time reporting of performance metrics defined by the naming community for root zone management.",
    "length": 362
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 0,
    "text": "News Atom feed All Update Blog Oversight Publication Consultation Blog 28 April 2025 PTI Board Adopts 2025 30 Strategic Plan and FY26 Operating Plan and Budget PTI's five year strategic plan set out objectives for the next five years for the IANA functions. Consultation 17 December 2024 Draft operating plans and budget for Fiscal Year 2026 Comment is invited on the draft operating plan and budget for the IANA functions for Fiscal Year 2026. Consultation 26 November 2024 Draft PTI Strategy for 2026-2030 Comment is invited on the draft strategic plan for the IANA functions for 2026-2030. Update 5 November 2024 DNSSEC trust anchor format update and DNS pre-publication We have updated the trust anchor XML to include data elements described in the upcoming RFC 7958bis document.",
    "length": 783
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 1,
    "text": "pdated the trust anchor XML to include data elements described in the upcoming RFC 7958bis document. Update 4 September 2024 Changes to HTTP service for example domains The websites served on the example domains (e.g. example.com, example.net, example.org, and example.edu) no longer support POST, PUT, DELETE, and PATCH requests. Update 24 July 2024 Update to DNSSEC trust anchors An update to the trust anchors for DNSSEC has been published. Oversight 18 July 2024 2023 Audit on Service Organization Controls for IANA functions completed The findings from our annual SOC2 and SOC3 audits, independently administered by RSM US LLP, have been published. Update 18 July 2024 Mailing list system migration Our mailing list platform is undergoing major upgrades.",
    "length": 759
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 2,
    "text": "e 18 July 2024 Mailing list system migration Our mailing list platform is undergoing major upgrades. Oversight 10 July 2024 IANA Survey Shows Consistent Results and Offers Insights Our annual survey of key stakeholders has been published, providing useful feedback for the ongoing evolution of our services. Update 23 May 2024 Root Zone DNSSEC Algorithm Rollover Study Issues Final Report The final report of our community study team has been published, providing guidance on how cryptographic algorithm changes to the DNS root zone should be performed in the future. Oversight 28 February 2024 Second IANA Naming Function Review commences ICANN has convened the periodical community review of the IANA Naming Functions, which performs an assessment every five years.",
    "length": 767
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 3,
    "text": "odical community review of the IANA Naming Functions, which performs an assessment every five years. Consultation 24 January 2024 Proposed Top-Level Domain String for Private Use IANA has made a provisional determination that  .INTERNAL  should be reserved for private-use and internal network applications. Prior to review and approval of this reservation by the ICANN Board, we are seeking feedback on whether the selection complies with the specified procedure from SAC113, and any other observations that this string would be an inappropriate selection for this purpose.",
    "length": 574
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 4,
    "text": "3, and any other observations that this string would be an inappropriate selection for this purpose. Consultation 19 October 2023 Draft Report of the Root Zone DNSSEC Algorithm Rollover Study A draft study on how to select a new cryptographic algorithm for the root zone, and how a rollover to that algorith, has been produced and we are now seeking comment. Blog 15 August 2023 A New Data Protection Mechanism for the Root Zone By the end of this year, the Domain Name System (DNS) root zone will introduce the ZONEMD record that will provide a new mechanism for network operators to validate its contents.",
    "length": 607
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 5,
    "text": "the ZONEMD record that will provide a new mechanism for network operators to validate its contents. Update 18 July 2023 Update on Hardware Security Modules and Rollover Plans for the Root Zone KSK Efforts to rollover to the recently generated new KSK will be paused while replacement hardware options continue to be evaluated. Update 10 June 2023 News service now available This section on the website is now available to aggregate operational updates and other updates of interest that we have historically published in different locations. Update 25 May 2023 Future update to IPv4 address for DNS root server The b.root-servers.net address is planned for an update in November 2023.",
    "length": 684
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 6,
    "text": "ddress for DNS root server The b.root-servers.net address is planned for an update in November 2023. Consultation 16 May 2023 Feedback sought on proposed bylaws amendments Proposals to update the PTI Bylaws, that govern the IANA functions, are open for public comment. Oversight 2 May 2023 System controls validated by 2022 IANA Functions audit The findings from our annual SOC2 and SOC3 audits, independently administered by RSM US LLP, have been published. Publication 28 April 2023 Deprecating infrastructure .INT domains RFC 9121 has been published which formalizes the removal of a number of legacy .INT domains by IANA. Update 13 April 2023 Root Zone KSK HSM Update Production of the hardware security modules (HSMs) used to store the Root Zone KSK is ceasing.",
    "length": 766
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 7,
    "text": "pdate Production of the hardware security modules (HSMs) used to store the Root Zone KSK is ceasing. IANA is commencing an initiative to study and identify alternatives, in the meantime the existing hardware is expected to continue to be used for in the coming years. Publication 30 March 2023 Registration procedures for private enterprise numbers (PENs) RFC 9371 has been published which updates the registration procedures for private enterprise numbers (PENs). Blog 13 March 2023 How time zones are coordinated The basics of how the IANA functions manage the Time Zone Database, an essential collection of rules that govern time relied upon around the world.",
    "length": 662
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 8,
    "text": "Time Zone Database, an essential collection of rules that govern time relied upon around the world. Update 2 March 2023 Schedule announced for next KSK key generation The next Root Zone KSK is planned to be generated at the next key signing ceremony on 27 April 2023. Consultation 21 February 2023 Design team convened for KSK algorithm rollover study A Root Zone Algorithm Rollover Study Design Team has been established to develop recommendations on how the cryptographic algorithm used for the root zone may be changed during future rollovers. Oversight 18 January 2023 ICANN s annual IANA customer survey shows shift in engagement preferences The 2022 IANA Customer Engagement Survey has been published.",
    "length": 707
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 9,
    "text": "y shows shift in engagement preferences The 2022 IANA Customer Engagement Survey has been published. Update 13 December 2022 Updated Root Zone Management System available An updated Root Zone Management System is now available. TLD managers have new features available to them in this release, including abilities to customize access and authorization policies. Update 2 December 2022 Root Zone Management System update A significant upgrade to the Root Zone Management System will be performed on 13 December 2022 and customers are encouraged to submit root zone changes in advance of that date. Update 2 December 2022 Holiday services IANA will operate on a modified schedule at the end-of-year, however all services continue to operate including emergency response.",
    "length": 768
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 10,
    "text": "schedule at the end-of-year, however all services continue to operate including emergency response. Update 1 December 2022 New private enterprise number system available A significant update has been made to the system that supports private enterprise number (PEN) registrations. A more interactive application and modification process has been implemented, along with a modern interface for browsing registrations. Consultation 1 December 2022 Webinar on updating the Root Zone Management System On 6 December 2022 at 16:00 to 17:00 UTC, you are invited to join a webinar covering the new features in the RZMS upgrade.",
    "length": 619
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 11,
    "text": "16:00 to 17:00 UTC, you are invited to join a webinar covering the new features in the RZMS upgrade. Oversight 16 November 2022 Call for volunteers to plan for changing the Root Zone DNSSEC algorithm ICANN recently announced on open call for volunteers to join a design team that will develop a plan for changing the cryptographic algorithm used for the Domain Name System (DNS) root key signing key and zone signing key. Consultation 15 September 2022 Draft operating plans and budget for Fiscal Year 2024 Comment is invited on the draft operating plan and budget for the IANA functions for Fiscal Year 2024.",
    "length": 609
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 12,
    "text": "mment is invited on the draft operating plan and budget for the IANA functions for Fiscal Year 2024. Consultation 7 September 2022 IANA Community Day in Brussels, Belgium In conjunction with the 2022 ICANN DNS Symposium, IANA will be holding a half-day workshop focused on key technical evolution projects within IANA relating to the DNS. Topics will include a discussion of how to perform a DNSSEC algorithm rollover for the DNS root zone, and reviewing and updating the TLD technical requirements for root zone changes. Consultation 25 July 2022 Webinar on IANA functions and PTI planning for Fiscal Year 2024 A webinar, open to all, will explain the annual planning process for the IANA functions and invite contributions on priorities for the coming year.",
    "length": 759
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 13,
    "text": "planning process for the IANA functions and invite contributions on priorities for the coming year. Oversight 8 July 2022 Final report of the Root Zone Update Process study The final report conducted by independent researchers on the Root Zone Update Process has been published. Update 7 June 2022 Common Questions on the Next-Generation Root Zone Management System Answers to commonly asked questions about our next-generation Root Zone Management System have been published. Blog 19 May 2022 Ushering in the next generation of Root Zone management IANA is preparing to launch a significant update to its Root Zone Management platform later this year. Update 21 March 2022 Revised guidance for RFC authors The help material for RFC authors, that augments RFC 8126, has been significantly updated.",
    "length": 797
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 14,
    "text": "C authors The help material for RFC authors, that augments RFC 8126, has been significantly updated. Consultation 14 March 2022 Initial Report on Root Zone Update Process Study open for comment Comment is invited on the initial report by independent researchers on the Root Zone Update Process. Oversight 22 February 2022 ICANN s Annual IANA Customer Survey Demonstrates Consistent High Performance The findings of our annual customer survey are now available online. Update 10 November 2021 Licensing terms for Protocol Registries IANA and IETF have collaboratively issued a joint statement concerning copyright in the IANA protocol parameter registries, confirming that they intend that the registries may be freely used by any party for any purpose.",
    "length": 752
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 15,
    "text": "es, confirming that they intend that the registries may be freely used by any party for any purpose. Blog 21 October 2021 Reflecting on IANA s Post-Transition Operations On the 5th anniversary of the transition to multistakeholder oversight of IANA, a review of what has happened since. Oversight 18 October 2021 IANA performance overview available The performance reporting section of the IANA website has been significantly updated. Notably there is now a high-level dashboard view of the key metrics used to assess IANA performance, on a rolling 3 month basis. Consultation 15 September 2021 Draft operating plan and budget for Fiscal Year 2023 The draft operating plan and budgets for the IANA functions, covering July 2022 to June 2023, is available for public comment.",
    "length": 774
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 16,
    "text": "nd budgets for the IANA functions, covering July 2022 to June 2023, is available for public comment. Update 12 August 2021 Root Anchor signature update The signature file that is used to validate the Root Zone Trust Anchor XML distribution is being updated. Consultation 15 July 2021 Webinar on IANA Functions and PTI planning for Fiscal Year 2023 A webinar, open to all, will explain the annual planning process for the IANA functions and invite contributions on priorities for the coming year. Oversight 30 March 2021 Study on Root Zone Management A study is commencing to review operations associated with root zone updates, and identify if improvements are needed to the robustness of the process.",
    "length": 701
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 17,
    "text": "ed with root zone updates, and identify if improvements are needed to the robustness of the process. Consultation 10 February 2021 IANA Naming Function Review: Recommendation for an IANA Naming Function contract amendment Feedback is sought in making a contractual amendment to remove a specific reporting requirement. Oversight 27 January 2021 2020 customer engagement survey shows increased satisfaction in performance The findings of our annual customer survey have been published. Oversight 21 January 2021 Root Zone KSK supporting documentation update A significant update to the documentation for the Root Zone KSK has been published. In addition to customary updates to the DPS, many supporting procedures and documents are now being published for the first time.",
    "length": 770
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 18,
    "text": "tes to the DPS, many supporting procedures and documents are now being published for the first time. Publication 30 October 2020 Nameservers for the Address and Routing Parameter Area (\"arpa\") domain RFC 9120 has been published, describing revisions to operational practices to separate the function of the \"arpa\" top-level domain in the DNS from its historical operation alongside the DNS root zone. Blog 30 October 2020 The Creation and Administration of Unique Identifiers, 1967-2017 A report has been published, commissioned by ICANN and Google, that documents the design, evolution and management of the Internet's unique identifiers.",
    "length": 639
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 19,
    "text": "nd Google, that documents the design, evolution and management of the Internet's unique identifiers. Consultation 8 October 2020 Public comment on the draft Fiscal Year 2022 operating plan and budgets Comment is invited on the draft operating plan and budget for the IANA functions for Fiscal Year 2022. Blog 15 September 2020 PTI publishes its first Strategic Plan Consultation 19 August 2020 Webinar on developing the Fiscal Year 2022 operating plan and budgets A webinar, open to all, will explain the annual planning process for the IANA functions and invite contributions on priorities for the coming year.",
    "length": 611
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 20,
    "text": "planning process for the IANA functions and invite contributions on priorities for the coming year. Blog 21 April 2020 Conducting a key signing ceremony in the face of COVID-19 A discussion of adjustments made to IANA operating procedures for key signing ceremonies, due to the COVID-19 pandemic. Update 26 March 2020 Contingency plans for the next Root KSK ceremony Due to the emergence of the Coronavirus pandemic, significant changes are being planned to enable us to conduct forthcoming key signing ceremonies.",
    "length": 514
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 21,
    "text": "c, significant changes are being planned to enable us to conduct forthcoming key signing ceremonies. Update 12 February 2020 Root Key Signing Key ceremony postponed The scheduled KSK ceremony has been postponed due to a mechanical failure in the key management facility Oversight 11 December 2019 IANA customer engagement survey results available The results of the annual customer survey on the IANA functions are now available. Update 6 November 2019 Allocation of /12 IPv6 address space to ARIN The unicast address block 2630::/12 has been allocated to ARIN based on their eligibility according to the IANA Policy for Allocation of IPv6 Blocks to Regional Internet Registries.",
    "length": 679
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 22,
    "text": "gibility according to the IANA Policy for Allocation of IPv6 Blocks to Regional Internet Registries. Consultation 6 November 2019 Proposal for future Root Zone KSK rollovers Following the completion of the first Root Zone KSK rollover, we are seeking input on establishing a three-year cadence for future rollovers. Update 16 October 2019 RIR allocation data dashboard available We now offer a new dashboard to reports RIR number resource allocation data. This data, including associated projections, are used to implement the global policies that govern IPv4, IPv6 and autonomous system allocations by IANA.",
    "length": 608
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 23,
    "text": "d to implement the global policies that govern IPv4, IPv6 and autonomous system allocations by IANA. Consultation 14 October 2019 Proposed changes to the IANA SLAs for ccTLD creation and transfers Comment is invited on a proposal to update the service level agreements associated with ccTLD delegation and transfer requests. Consultation 10 June 2019 Proposed IANA SLAs for publishing LGRs/IDN tables The Customer Standing Committee, ICANN and PTI have agreed a new set of metrics to govern label generation ruleset (LGR) processing, which are now available for public comment.",
    "length": 577
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 24,
    "text": "ics to govern label generation ruleset (LGR) processing, which are now available for public comment. Update 5 June 2019 Allocation of /12 IPv6 address space to RIPE NCC The unicast address block 2a10::/12 has been allocated to RIPE NCC based on their eligibility according to the IANA Policy for Allocation of IPv6 Blocks to Regional Internet Registries. Update 8 May 2019 Reorganization of autonomous system (AS) number registry The AS Number registry has been simplified to only indicate block allocations made by IANA to the RIRs. Update 12 March 2019 Allocation of /19 IPv6 address space to RIPE NCC The unicast address block 2001:2000::/19 has been allocated to RIPE NCC based on their eligibility according to the IANA Policy for Allocation of IPv6 Blocks to Regional Internet Registries.",
    "length": 794
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 25,
    "text": "gibility according to the IANA Policy for Allocation of IPv6 Blocks to Regional Internet Registries. This allocation incorporates earlier smaller allocations of 2001:2000::/20, 2001:3000::/21, and 2001:3800::/22 made on 2004-05-04. Update 1 March 2019 Final IPv4 allocations made from recovered pool IANA has allocated 2 /24 address space to each to the five regional Internet registries from its recovered pool. This effectively exhausts the address space IANA has to allocate according to the Global Policy for Post Exhaustion IPv4 Allocation Mechanisms by the IANA. Update 1 October 2018 Root Zone service during the upcoming KSK rollover We encourage TLD managers to avoid discretionary root zone changes on 11 October 2018 in light of our intention to change the Root Zone KSK on that date.",
    "length": 795
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 26,
    "text": "zone changes on 11 October 2018 in light of our intention to change the Root Zone KSK on that date. Update 24 May 2018 Privacy policy and terms of service We have updated our privacy policies and certain website terms of service to provide greater transparency, promote simplification, and align with recent changes in privacy laws applicable to us. Blog 8 February 2018 Progressing the IANA functions into 2018 A summary of the adjustments and changes to the IANA functions in the first year after the IANA stewardship transition. Oversight 18 January 2018 IANA functions customer survey results available The findings of the annual IANA customer survey are now available.",
    "length": 673
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 27,
    "text": "customer survey results available The findings of the annual IANA customer survey are now available. Update 26 October 2017 New DNSSEC algorithm support for TLDs TLD managers may now sign their zones with GOST or ECDSA and list their respective delegation signer records in the DNS root zone. Oversight 17 October 2017 Prepare for the 2017 IANA annual customer survey Commencing the week of 2017-10-23, our partner Ebiquity will invite our customers over the past year to participate in our annual survey. This anonymous survey helps us plan for the future by identifying our performance and ways we can improve. It will automatically be sent to those who have transacted requests with us in the past year, along with other key contacts within our community.",
    "length": 758
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 28,
    "text": "ve transacted requests with us in the past year, along with other key contacts within our community. Update 27 September 2017 Root Zone key rollover postponed The plan to sign the root zone with a new KSK starting in October 2017 has been postponed, in response to freshly analyzed data the suggests more resolvers than expected are signaling they do not yet recognize the new KSK. Update 26 September 2017 .INT zone is now DNSSEC signed As of 2017-09-26, the .INT zone is signed with a secure delegation from the DNS root zone. Oversight 26 September 2017 Root Zone Maintainer monthly reports now available We are now publishing the monthly reports ICANN receives from the Root Zone Maintainer.",
    "length": 695
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 29,
    "text": "ow available We are now publishing the monthly reports ICANN receives from the Root Zone Maintainer. These reports document adherence to the service level agreements between ICANN and Verisign for the performance of this function, which is a component of the Root Zone Management process. Publication 30 June 2017 Guidelines for writing an IANA Considerations section in RFCs RFC 8126 has been published, providing best current practice for RFC authors on how to develop IANA Considerations in their documents. Update 22 June 2017 Forthcoming Root Zone KSK rollover For the first time the Root Zone KSK will be changed, and DNS operators should learn about the potential impacts.",
    "length": 679
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 30,
    "text": "time the Root Zone KSK will be changed, and DNS operators should learn about the potential impacts. Oversight 18 May 2017 Call for volunteers as Trusted Community Representatives We are seeking interested individuals who wish to act as Trusted Community Representatives. These individuals are an important component of how we manage the Root Zone Key Signing Key, the trust anchor for the global Domain Name System. By inviting recognized members of the DNS technical community to be part of the Root Zone KSK operations, we seek to improve confidence and acceptance in the DNSSEC security mechanism among the wider Internet community.",
    "length": 635
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 31,
    "text": "prove confidence and acceptance in the DNSSEC security mechanism among the wider Internet community. Update 19 April 2017 Updates to the Trusted Community Representative selection process Adjustments have been made to implement an evergreen process for TCR appointments and rotation. Oversight 14 April 2017 First monthly report to the Internet numbering community We have published our first report to the Internet numbering community. This report is the first of a regularly monthly reporting on our performance of allocations to Regional Internet Registries, and is one deliverable from the IANA stewardship transition process.",
    "length": 630
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 32,
    "text": "o Regional Internet Registries, and is one deliverable from the IANA stewardship transition process. Oversight 2 March 2017 Completion of annual audits The annual audits of both our Root Zone Key Signing Key (DNSSEC) operations, and our Registry Assignment and Maintenance Systems, have been completed. Update 3 February 2017 New Root Zone trust anchor being distributed Following successful key ceremonies in October 2016 and February 2017, a new key signing key for the DNS root zone has been generated that is expected to be used later in 2017. Software implementing DNSSEC validation should obtain the revised root anchors <https://www.iana.org/dnssec/files> in our repository. This is an important step in the KSK Rollover project <https://www.icann.org/resources/pages/ksk-rollover>.",
    "length": 789
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 33,
    "text": "an important step in the KSK Rollover project <https://www.icann.org/resources/pages/ksk-rollover>. Oversight 11 January 2017 2016 annual customer survey available In September 2016, we invited our customers to participate in our fifth annual customer satisfaction survey. We have now published the compiled results, showing continued very positive satisfaction from our communities. Oversight 21 December 2016 First monthly reports to the Customer Standing Committee available We have published our first reports to the newly formed Customer Standing Committee. These reports are the first of regularly monthly reporting to this new committee, which was created as part of the IANA stewardship transition process.",
    "length": 714
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 34,
    "text": "porting to this new committee, which was created as part of the IANA stewardship transition process. Oversight 1 October 2016 IANA Stewardship Transition completed As of 2016-10-01, the IANA functions are being provided by Public Technical Identifiers, a new affiliate of ICANN. Oversight 1 October 2016 Revised DNSSEC Practice Statement for the Root Zone KSK A revised edition of the Root Zone KSK DNSSEC Practice Statement (DPS) has been published, and is effective immediately. Update 1 October 2016 Increased size of the Root Zone zone signing key Following pre-publication since 2016-09-20, the zone signing key used to sign the DNS root zone has been increased in size from 1024 bits to 2048 bits.",
    "length": 703
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 35,
    "text": "e signing key used to sign the DNS root zone has been increased in size from 1024 bits to 2048 bits. Oversight 14 September 2016 2016 Annual Customer Survey ICANN has engaged Ebiquity to administer its 2016 Annual Customer Survey. If you have made use of IANA request services in the last year you can expect to receive an invitation from Judy Bromley to participate in a survey hosted at https://www.ebiquityinsights.com/. Update 6 September 2016 Increased Root Zone and .ARPA signature validity periods The validity period of DNSSEC signatures in the Root and ARPA zones has been increased from 10 days to 13 days.",
    "length": 616
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 36,
    "text": "y period of DNSSEC signatures in the Root and ARPA zones has been increased from 10 days to 13 days. Publication 30 August 2016 Representing Label Generation Rulesets Using XML RFC 7940 has been published, enabled label generation rulesets (formerly known as IDN tables) to be precisely expressed in a machine readable format. This work originated in work by the IANA team on formalizing these rulesets, and is expected to support a number of community activities to enhance IDN deployment. Oversight 26 May 2016 Revised DNSSEC Practice Statement for the Root Zone KSK A revised edition of the Root Zone KSK DNSSEC Practice Statement (DPS) has been published, and is effective immediately.",
    "length": 689
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 37,
    "text": "the Root Zone KSK DNSSEC Practice Statement (DPS) has been published, and is effective immediately. Oversight 22 April 2016 Annual audit process completed The annual audits of both our Root Zone DNSSEC operations, and our IANA Registry Management Systems, have been completed. Update 1 March 2016 RDAP server support for TLD managers TLD managers are now able to list their RDAP servers through their root zone management interface. Oversight 16 December 2015 2015 annual customer survey results available We recently conducted our fourth annual customer satisfaction survey. Oversight 29 September 2015 2015 annual customer survey underway ICANN is currently conducting the 2015 Annual IANA Customer Satisfaction Survey.",
    "length": 721
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 38,
    "text": "mer survey underway ICANN is currently conducting the 2015 Annual IANA Customer Satisfaction Survey. If you have made use of the IANA services in the last year you should have received an invitation from Jennifer Clark at Ebiquity to participate in a survey hosted at https://www.ebiquityinsights.com/. Reminder emails will be sent next week asking for your participation before the survey closes on October 13th. Update 28 February 2015 .TP (Portuguese Timor) has been retired The .TP domain has been removed from the root zone, following a transition to its successor domain .TL (Timor-Leste). Oversight 17 December 2014 2014 annual customer survey results available In September 2014 ICANN invited customers of the IANA services to participate in its third annual customer satisfaction survey.",
    "length": 796
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 39,
    "text": "ited customers of the IANA services to participate in its third annual customer satisfaction survey. The report summarizes the survey methodology and the responses received and compares them to last year's results. Oversight 11 September 2014 2014 annual customer survey underway ICANN has engaged Ebiquity to administer its 2014 Annual Customer Survey. If you have made use of IANA request services in the last year you can expect to receive an invitation from Jennifer Clark to participate in a survey hosted at https://www.ebiquityinsights.com/. Update 20 May 2014 IPv4 recovery allocations The global recovery pool has been activated under the conditions of the governing policy. Code has been developed and published by IANA on how it will allocate IPv4 address blocks from the recovery pool.",
    "length": 797
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 40,
    "text": "developed and published by IANA on how it will allocate IPv4 address blocks from the recovery pool. Oversight 14 January 2014 IANA customer survey now available In November 2013, ICANN invited customers of the IANA services to participate in its second annual customer satisfaction survey. Oversight 10 October 2013 Committed to Excellence We are committed to operations excellence and have had an ongoing Business Excellence activity for the IANA functions since 2009. We are pleased to have received EFQM Committed to Excellence <http://www.efqm.org/what-we-do/recognition/committed-to-excellence> recognition for these departments following an assessment conducted by a panel of three independent assessors in August 2013.",
    "length": 725
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 41,
    "text": "artments following an assessment conducted by a panel of three independent assessors in August 2013. Update 2 October 2013 Removal of eleven test internationalized top-level domains from the Root Zone The testing period for internationalized top-level domains (IDNs) in the DNS root zone has successfully concluded. The test IDN TLDs will be retired from the DNS root zone on 31 October 2013 Update 14 December 2012 D-root is changing its IPv4 address on 3 January 2013 We are sharing an advisory that one of the DNS root servers is updating its IP address. Oversight 4 December 2012 IANA review process ICANN is conducting a number of reviews regarding how the IANA functions are performed.",
    "length": 691
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 42,
    "text": "view process ICANN is conducting a number of reviews regarding how the IANA functions are performed. Oversight 5 July 2012 IANA customer survey In April and May 2012 ICANN invited users of the root zone management; protocol parameters management; and Internet Number Resources management services to participate in a customer satisfaction survey. We have now analyzed the results and are happy to report that the response rate was very healthy 22% and the feedback was very positive. Update 6 May 2012 Global policy for post-exhaustion IPv4 allocation mechanisms A new global policy has been ratified that guides IANA on making IPv4 allocations to RIRs smaller than /8, following the exhaustion of IANA's inventory of unallocated /8 address space.",
    "length": 747
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 43,
    "text": "RIRs smaller than /8, following the exhaustion of IANA's inventory of unallocated /8 address space. Oversight 23 April 2012 IANA customer survey We are conducting a short, one page survey to gather our customers  perspective on the way ICANN provides IANA services. The survey will provide us with baseline customer satisfaction data we can measure against in the future. The survey is open until 11 May 2012, and we will summarize the results and publish the summary by the end of June 2012. Update 15 July 2011 Implementation of Root Zone Management System Scheduled maintenance of the DNS Root Management Systems will be conducted for one day commencing 2011-07-21 at 0000 UTC.",
    "length": 680
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 44,
    "text": "of the DNS Root Management Systems will be conducted for one day commencing 2011-07-21 at 0000 UTC. Operation and availability of the DNS root zone will be unaffected, however there may be minor delays in processing root zone change requests for TLD managers. Update 4 November 2010 End of life notice for Interim Trust Anchor Repository The Interim Trust Anchor Repository (ITAR) will be retired over the coming months. Its functions have been replaced by the signed DNS root zone, and all functionality is now integrated with root zone management.",
    "length": 549
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 45,
    "text": "aced by the signed DNS root zone, and all functionality is now integrated with root zone management. Update 15 July 2010 Root Zone now signed The DNS Root Zone is now signed with DNSSEC, with trust anchors and other information now available Update 14 July 2010 Moratorium for Root Zone Changes during DNSSEC transition Root zone changes are temporarily suspended during the DNSSEC rollout.",
    "length": 390
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 46,
    "text": "nges during DNSSEC transition Root zone changes are temporarily suspended during the DNSSEC rollout. Blog 20 May 2010 Try the new IANA WHOIS server A new IANA WHOIS server is available for testing Blog 14 January 2010 Situation in Haiti and the DNS Updates on the .HT domain and Intranet infrastructure following a major earthquake impacting Haiti Update 9 September 2009 Selection mechanism for the remaining IPv4 address space A notification of the process associated with allocation of the last remaining IPv4 unicast address space from IANA to the regional Internet registries. Update 12 December 2008 New IPv6 address for  L  DNS root service The set of DNS root servers served under the hostname l.root-servers.net now have IPv6 capability, and have been added to the DNS root zone.",
    "length": 788
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 47,
    "text": "the hostname l.root-servers.net now have IPv6 capability, and have been added to the DNS root zone. We encourage operators of DNS infrastructure to update their DNS software to the most-updated IP addresses for the root servers. Update 22 October 2008 Analysis of processing issue with recent IPv6 nameserver change request A request was processed that did not identify impacted TLDs correctly. Update 14 July 2008 Migration to XML for protocol parameter registries Significant updates are being made to migrate to XML as the baseline format for most protocol parameter registries maintained by IANA.",
    "length": 600
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 48,
    "text": "to migrate to XML as the baseline format for most protocol parameter registries maintained by IANA. Update 18 June 2008 Autonomous system number registry format updates The five Regional Internet Registries and the IANA have cooperated to provide an update to the IANA Autonomous System (AS) Numbers Registry. The updated registry keeps the same format but includes more detailed and accurate information about the whois servers providing registration information for individual AS Numbers. In addition to the current format, the AS Numbers registry will be made available in XML during July.",
    "length": 592
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 49,
    "text": "n addition to the current format, the AS Numbers registry will be made available in XML during July. Update 5 May 2008 Sample XML registry for IPv4 address space IANA is currently engaged in a project to convert the protocol registries IANA maintains to XML to provide the community with improved ways of viewing registry information. An example of the registry with XML as the source has been published as a demonstration to the community. The temporary URL will work until the production launch of IANA's XML registries, at which time it will no longer function. Update 26 March 2008 Service degradation in IANA public WHOIS services for top-level domains For several weeks updates to top-level domain data was not correctly propagated through our WHOIS service.",
    "length": 764
  },
  {
    "url": "https://www.iana.org/news",
    "domain": "www.iana.org",
    "title": "News",
    "chunk_id": 50,
    "text": "veral weeks updates to top-level domain data was not correctly propagated through our WHOIS service. Update 21 February 2008 Update to the IPv4 registry format and content The IPv4 global address space registry has been restructured. those made before the RIR system), each /8 will now be designated to an RIR who in turn tracks allocations within that block. Update 29 January 2008 IPv6 addresses for the root servers For the first time, the DNS root servers will be accessible over IPv6 transport..",
    "length": 500
  },
  {
    "url": "https://www.iana.org/time-zones",
    "domain": "www.iana.org",
    "title": "Time Zone Database",
    "chunk_id": 0,
    "text": "Time Zone Database The Time Zone Database (often called tz or zoneinfo ) contains code and data that represent the history of local time for many representative locations around the globe. It is updated periodically to reflect changes made by political bodies to time zone boundaries, UTC offsets, and daylight-saving rules. Its management procedure is documented in BCP 175: Procedures for Maintaining the Time Zone Database. Latest version 2025c (Released 2025-12-10) File Description tzdb-2025c.tar.lz (543.4kb) Complete Distribution (Data, Code and Extras) tzdata2025c.tar.gz (458.4kb) Data Only Distribution tzcode2025c.tar.gz (312.7kb) Code Only Distribution Mailing Lists Announcements: A low-volume announcement mailing list used for announcing updates to the Time Zone Database.",
    "length": 787
  },
  {
    "url": "https://www.iana.org/time-zones",
    "domain": "www.iana.org",
    "title": "Time Zone Database",
    "chunk_id": 1,
    "text": "ments: A low-volume announcement mailing list used for announcing updates to the Time Zone Database. Subscribe/Unsubscribe Archive Submissions and Discussion: A higher volume discussion list used for discussing proposals for updates to the Database. Subscribe/Unsubscribe Archive Distribution We provide access to the Time Zone Database via three methods: HTTP: https://www.iana.org/time-zones FTP: ftp://ftp.iana.org/tz/ Rsync: rsync://rsync.iana.org/tz/ TZ Coordinator The IESG-designated TZ Coordinators are Paul Eggert (primary) and Tim Parenti (secondary). Further information Further information on the Time Zone Database, including implementation details, is described in the code repository ..",
    "length": 701
  },
  {
    "url": "https://www.iana.org/abuse",
    "domain": "www.iana.org",
    "title": "Abuse Issues",
    "chunk_id": 0,
    "text": "Does it look like we re attacking you? Some of the most common things we hear are  My network is under attack by IANA!  and  IANA is spamming me!  If you think this is the case, please take a few moments to read this page. The Internet Assigned Numbers Authority, or IANA, is responsible for the global coordination of IP addresses. Most of the used numbers are allocated via a regional allocation system to your ISP, which then automatically assigns one or more to you. There are, however, special sets of numbers that are designed not to be assigned to any particular person. Instead, they are general allocations that are either used in special ways, or designed for people to use internally within local networks.",
    "length": 717
  },
  {
    "url": "https://www.iana.org/abuse",
    "domain": "www.iana.org",
    "title": "Abuse Issues",
    "chunk_id": 1,
    "text": "hat are either used in special ways, or designed for people to use internally within local networks. Shows up in your logs with a name like blackhole-1.iana.org There are additional ranges of numbers that are also marked as  IANA Reserved  and similarly are not operated by IANA, although these are the most common ones we receive abuse reports concerning. If you are seeing unexplained Internet traffic to your computer from these numbers, it is important to remember the following things: The traffic does not come from IANA. As the authority for IP addresses, we have simply reserved these numbers in our databases, but we do not use or operate them, and we are not the source of the traffic. As use of these numbers is untracked and unrestricted, we can not tell you who is using these numbers.",
    "length": 798
  },
  {
    "url": "https://www.iana.org/abuse",
    "domain": "www.iana.org",
    "title": "Abuse Issues",
    "chunk_id": 2,
    "text": "use of these numbers is untracked and unrestricted, we can not tell you who is using these numbers. If you see these numbers in the headers of an unsolicited email, they usually indicate transit between servers within a corporate network or ISP. In such cases you can usually find the true origin by looking for the earliest  Received  mail header that is not an IANA Reserved address.",
    "length": 385
  },
  {
    "url": "https://www.iana.org/domains/arpa",
    "domain": "www.iana.org",
    "title": ".ARPA Domain",
    "chunk_id": 0,
    "text": ".ARPA Zone Management The .arpa domain is the  Address and Routing Parameter Area  domain and is designated to be used exclusively for Internet-infrastructure purposes. We administer the domain in cooperation with the Internet technical community through the guidance of the Internet Architecture Board.",
    "length": 303
  },
  {
    "url": "https://www.iana.org/domains/arpa",
    "domain": "www.iana.org",
    "title": ".ARPA Domain",
    "chunk_id": 1,
    "text": "ation with the Internet technical community through the guidance of the Internet Architecture Board. The .arpa domain currently includes the following second-level domains: Domain Usage / Reference 6tisch.arpa For IPv6 over the Time-Slotted Channel Hopping mode of IEEE 802.15.4 RFC 9031 arpa Reserved exclusively to support operationally-critical infrastructural identifier spaces as advised by the Internet Architecture Board RFC 3172 as112.arpa For sinking DNS traffic for reverse IP address lookups and other applications RFC 7535 e164.arpa For mapping E.164 numbers to Internet URIs RFC 6116 eap-noob.arpa (DEPRECATED) For the Nimble Out-Of-Band authentication method of the Extensible Authentication Protocol framework RFC 9140 draft-ietf-emu-eap-arpa-10 eap.arpa For provisioning within the Extensible Authentication Protocol framework draft-ietf-emu-eap-arpa-10 home.arpa For non-unique use in residential home networks RFC 8375 in-addr-servers.arpa For hosting authoritative name servers for the in-addr.arpa domain RFC 5855 in-addr.arpa For mapping IPv4 addresses to Internet domain names RFC 1035 ip6-servers.arpa For hosting authoritative name servers for the ip6.arpa domain RFC 5855 ip6.arpa For mapping IPv6 addresses to Internet domain names RFC 3152 ipv4only.arpa For detecting the presence of DNS64 and for learning the IPv6 prefix used for protocol translation RFC 7050 iris.arpa For locating Internet Registry Information Services RFC 4698 ns.arpa For hosting authoritative name servers for the .arpa domain RFC 9120 resolver.arpa For discovery of designated DNS resolvers RFC 9462 service.arpa For DNS-based service discovery over unicast RFC 9665 uri.arpa For resolving Uniform Resource Identifiers according to the Dynamic Delegation Discovery System RFC 3405 RFC 8958 urn.arpa For resolving Uniform Resource Names according to the Dynamic Delegation Discovery System RFC 3405 Maintain Changes to the .arpa zone must be coordinated manually with us ..",
    "length": 1974
  },
  {
    "url": "https://www.iana.org/domains/int",
    "domain": "www.iana.org",
    "title": "Intergovernmental Treaty (.INT) Domains",
    "chunk_id": 0,
    "text": ".INT Zone Management The .int domain is a specialized domain offering registrations solely to intergovernmental organisations. In brief, the .int domain is used for registering organisations established by international treaties between or among national governments. Only one registration is allowed for each organisation. There is no fee for registering an .int domain name. Maintain Register or Modify a .int domain Note: Be sure you read the eligibility criteria before applying for a .int domain to ensure you meet the rules, and that you have relevant documentation. Policy & Procedures Eligibility Criteria for a .int Domain Domain Name System Structure and Delegation (RFC 1591, March 1994)",
    "length": 698
  },
  {
    "url": "https://www.iana.org/domains/root",
    "domain": "www.iana.org",
    "title": "Root Zone Management",
    "chunk_id": 0,
    "text": "This role means assigning the operators of top-level domains, such as .uk and .com , and maintaining their technical and administrative details. Browse The Root Zone Database contains the authoritative record of the operators of various top-level domains. Root Zone Database Maintain TLD operators can change their delegation details by submitting revised details using our online interface, or via the email template. Root zone change requests Hint and Zone Files Root hint and root zone files including the root zone DNSSEC trust anchors. Hint and Zone Files Policy, Procedures and Guides Domain Name System Structure and Delegation (RFC 1591, March 1994) Other procedures and guides...",
    "length": 688
  },
  {
    "url": "https://www.iana.org/domains/root",
    "domain": "www.iana.org",
    "title": "Root Zone Management",
    "chunk_id": 1,
    "text": "es Domain Name System Structure and Delegation (RFC 1591, March 1994) Other procedures and guides... DNSSEC Key Signing Key Information Information regarding our role as operator of the Key Signing Key for the DNS Root Zone. Root Zone DNSSEC Trust Anchors KSK Ceremony Materials Policies and Procedures for Root Zone Key Management Trusted Community Representatives Third-Party Audit Certification Public Announcement Mailing List Projects Project Archive Archived project information relating to the initial launch of DNSSEC in the Root Zone, and the subsequent first KSK rollover..",
    "length": 583
  }
]